tropes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
          "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
  <head>
    <meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
    <meta  name="viewport" content="width=device-width, initial-scale=1" />
    <title>MATT THOMPSON</title>
    <meta  name="generator" content="Org-mode" />
    <link rel="stylesheet" type="text/css" href="style.css" />
  </head>
  <body>
    <div id="content">
      <header>
        <h1 class="title">MATT THOMPSON</h1>
      </header><hr  />
      <div id="outline-container-orgheadline1" class="outline-2">
        <h2 id="orgheadline1">Describing Tropes With Interval Temporal Logic</h2>
        <div class="outline-text-2" id="text-orgheadline1">
          <p>
            (Work in progress)
          </p>

          <p>
            Taking popular examples from the <a href="http://www.designthroughstorytelling.net/periodic/">Periodic Table of Storytelling</a> (derived from <a href="http://tvtropes.org/">TVTropes</a>), and describing them using Interval Temporal Logic.
          </p>

          <p>
            TVTropes has the concept of <a href="http://tvtropes.org/pmwiki/pmwiki.php/Main/OmnipresentTropes">Omnipresent Tropes</a>, which are tropes that are ubiquitous to storytelling. I try to cover most of them here, as well as some less vital but common tropes.
          </p>
        </div>

        <div id="outline-container-orgheadline13" class="outline-3">
          <h3 id="orgheadline13">Story structure</h3>
          <div class="outline-text-3" id="text-orgheadline13">
          </div><div id="outline-container-orgheadline2" class="outline-4">
            <h4 id="orgheadline2">Plot</h4>
            <div class="outline-text-4" id="text-orgheadline2">
              <p>
                A plot is a series of events. Must have:
              </p>

              <ul class="org-ul">
                <li>cause and effect (physics)</li>
                <li>emotional motivation (biology), and</li>
                <li>reason (logic and ethics)</li>
              </ul>

              <p>
                If it doesn't have these, then a plot hole is the result (or in our case, the plot is unsatisfiable).
              </p>
            </div>
          </div>

          <div id="outline-container-orgheadline3" class="outline-4">
            <h4 id="orgheadline3">Conflict</h4>
            <div class="outline-text-4" id="text-orgheadline3">
              <p>
                <a href="http://tvtropes.org/pmwiki/pmwiki.php/Main/Conflict">http://tvtropes.org/pmwiki/pmwiki.php/Main/Conflict</a>
              </p>

              <p>
                Arthur Quiller-Couch says there are seven kinds of conflict creating seven basic plots:
              </p>
              <ol class="org-ol">
                <li>Man vs Man</li>
                <li>Man vs Self</li>
                <li>Man vs Nature</li>
                <li>Man vs Society</li>
                <li>Man vs God/Fate</li>
                <li>Man caught in the middle of other characters/conflicts</li>
                <li>Male and female</li>
                <li>Man vs machine (added as an extension)</li>
              </ol>

              <p>
                Could just be boiled down to the first three ("Man" is defeatable, "nature" is to be survived or changed rather than defeated).
              </p>

              <p>
                So, taking just the first three:
              </p>

              <p>
                \(
                \mathit{conflict(X, Y)}\land
                [B] (\mathit {problem(X, Y})\land
                \langle E \rangle \mathit{resolution(problem(X, Y))}
                \)
              </p>

              <p>
                &#x2026;where \(X\) is "entityA" and \(Y\) can be "entityA", "entityB" or "nature".
              </p>

              <p>
                (consider replacing "problem" here with "inciting incident")
              </p>
            </div>
          </div>

          <div id="outline-container-orgheadline8" class="outline-4">
            <h4 id="orgheadline8">Three Act Structure</h4>
            <div class="outline-text-4" id="text-orgheadline8">
              <p>
                <a href="http://tvtropes.org/pmwiki/pmwiki.php/Main/ThreeActStructure">http://tvtropes.org/pmwiki/pmwiki.php/Main/ThreeActStructure</a>
              </p>
              <ul class="org-ul">
                <li>Setup, confrontation, resolution</li>
                <li>(leads to a climax in the third act)</li>
                <li>Setup is <a href="#orgheadline4">Call to Adventure</a>, or just an <a href="#orgheadline5">Inciting Incident</a></li>
                <li>In confrontation, protagonist and antagonist must clash or obstacles must be faced</li>
                <li>Resolution contains <a href="#orgheadline6">Climax</a> and <a href="#orgheadline7">Dénouement</a>.</li>
              </ul>

              <p>
                \(
                \mathit{setup(X, Y) \land (\mathit{callToAdventure(X)} \lor \mathit{incitingIncident(X)})}
                \)
              </p>

              <p>
                \(
                \mathit{confrontation(X, Y)} \land [D] (\mathit{fight (X, Y)} \lor \mathit{struggle (X)})
                \)
              </p>

              <p>
                \(
                \mathit{resolution(Z) \land [E] Z}
                \)
              </p>

              <p>
                \(
                \mathit{threeActStructure(X, Y)} \land
                [B] \mathit{setup (X, Y)} \land
                [D] \mathit{confrontation (X, Y)} \land
                [E] \mathit{resolution (setup(X, Y))}
                \)
              </p>

              <p>
                (And consider replacing "confrontation" here with "conflict", as above)
              </p>

              <p>
                (and "resolution" with "climax", as below)
              </p>

              <p>
                (also: "setup" could be the "inciting incident", below)
              </p>
            </div>
          </div>

          <div id="outline-container-orgheadline6" class="outline-4">
            <h4 id="orgheadline6">Climax</h4>
            <div class="outline-text-4" id="text-orgheadline6">
              <p>
                <a href="http://tvtropes.org/pmwiki/pmwiki.php/Main/TheClimax">http://tvtropes.org/pmwiki/pmwiki.php/Main/TheClimax</a>
              </p>

              <ul class="org-ul">
                <li>Must have <a href="#orgheadline8">Three Act Structure</a></li>
                <li><a href="#orgheadline3">Conflict</a> must be resolved by the third act</li>
                <li><a href="#orgheadline7">Dénouement</a> must occur to explain loose ends</li>
                <li>Climax can be some sort of big fight between protagonist and antagonist</li>
                <li>Type of climax depends on the genre and the setup</li>
                <li>For example, the protagonist and antagonist could fight over the <a href="#orgheadline9">MacGuffin</a></li>
                <li>Or the detective could solve the murder mystery</li>
                <li>I suggest just having this as a necessary component of <a href="#orgheadline8">Three Act Structure</a></li>
              </ul>

              <p>
                Simply describe it as a list of types of climax (fight between protagonist and antagonist, solving of the murder, etc)
              </p>

              <p>
                \(
                \mathit{climax} \land [D] (\mathit{fight (X, Y)} \lor
                \mathit{struggle (X)})
                \)
              </p>
            </div>
          </div>

          <div id="outline-container-orgheadline7" class="outline-4">
            <h4 id="orgheadline7">Dénouement</h4>
            <div class="outline-text-4" id="text-orgheadline7">
              <p>
                <a href="http://tvtropes.org/pmwiki/pmwiki.php/Main/Denouement">http://tvtropes.org/pmwiki/pmwiki.php/Main/Denouement</a>
              </p>

              <p>
                The aftermath of the action, where loose ends are tied up.
              </p>

              <p>
                It could be:
              </p>

              <ul class="org-ul">
                <li>happy ending</li>
                <li>consequences of a tragic ending (funeral of the hero, for example)</li>
                <li>more examples in the tvtropes page</li>
              </ul>
            </div>
          </div>


          <div id="outline-container-orgheadline9" class="outline-4">
            <h4 id="orgheadline9">MacGuffin</h4>
            <div class="outline-text-4" id="text-orgheadline9">
              <p>
                <a href="http://tvtropes.org/pmwiki/pmwiki.php/Main/MacGuffin">http://tvtropes.org/pmwiki/pmwiki.php/Main/MacGuffin</a>
              </p>

              <p>
                <i>A motivating element in a story that is used to drive the plot</i>
              </p>

              <p>
                The Maltese falcon, the holy grail, the briefcase of money, the Golden Fleece, etc. A MacGuffin must be:
              </p>

              <ul class="org-ul">
                <li>interchangeable. It could be anything, it just happens to be whatever it is in the story.</li>
                <li>Not used in the story. If it does something and is used, it's a <a href="#orgheadline10">Plot Device</a>, not a MacGuffin.</li>
              </ul>

              <p>
                It seems that MacGuffins are always parts of <a href="#orgheadline11">Quest</a>s. Is a quest a type of <a href="#orgheadline3">Conflict</a>, that's only resolved by the retrieval of a MacGuffin?
              </p>

              <p>
                \(
                \mathit{macguffinQuest} \land [B] \mathit{loss (macguffin)} \land [E] \mathit{find (macguffin)}
                \)
              </p>
            </div>
          </div>
