tropes.org
*** Quest
http://tvtropes.org/pmwiki/pmwiki.php/Main/TheQuest

A quest must have a hero (and supporters), travelling in search of something. Could be a [[MacGuffin]], to defeat the antagonist, or to rescue someone. Or all of these.

See [[MacGuffin]] above.

\(
\mathit{defeatQuest} \land [B] \mathit{find (Antogonist)} \land [E] (\mathit{defeat (Antagonist)} \lor \mathit{defeat(Protagonist)}))
\)

\(
\mathit{rescueQuest} \land [B] \mathit{find (Rescuee)} \land [E] \mathit{rescue (Rescuee)}
\)

\(
\mathit{quest} \land [D] (\mathit{macguffinQuest} \lor \mathit{defeatQuest} \lor \mathit{rescueQuest})
\)

*** The Reveal
http://tvtropes.org/pmwiki/pmwiki.php/Main/TheReveal

The resolution of a twist. The audience is given new information which has been withheld to create suspense.

This is a key trope in murder mysteries. In that case, you know that there's a mystery to be solved, and it's solved by the end. Other times, the reveal is a shock (like the endings of /The Empire Strikes Back/ and /Fight Club/).

\(
\mathit{secret(father(Darth, Luke))} \land [E] \mathit{reveal (father(Darth, Luke))}
\)

** Setting/location
*** Inciting Incident
http://tvtropes.org/pmwiki/pmwiki.php/Main/IncitingIncident

The first thing that sets in motion the sequence of events that form the plot. Ideally, it should foreshadow what the [[Climax]] will be like.

If it's part of a quest story, the inciting incident would be the [[Call to Adventure]].

*** Call to Adventure
http://tvtropes.org/pmwiki/pmwiki.php/Main/CallToAdventure


First step on Campbell's [[Hero's Journey]]. The hero discovers that he must leave the known world behind and go forth to unknown places.

If a hero initially rejects the call, they usually end up worse off for it.

*** Hero's Journey
http://tvtropes.org/pmwiki/pmwiki.php/Main/TheHerosJourney

Can be boiled down to three stages:

1. Departure (hero leaves familiar world behind)
2. Initiation (hero learns to navigate the unfamiliar world of adventure)
3. Return: the Hero returns to the familiar world

There's more to it than that (see below), but we shouldn't be concerned with that for now.

This is analogous to the three parts of the [[Three Act Structure]], so can be seen as a variation on that.

Call to adventure --(supernatural aid)--> Threshold Guardian -->
Threshold (between the known and unknown) --(challenges: helper, mentor, temptation)-->
REVELATION: Abyss death & rebirth-->Transformation-->Atonement-->
Return-->Call to adventure again
** Characters
*** Heroes
**** The Chosen One
http://tvtropes.org/pmwiki/pmwiki.php/Main/TheChosenOne
**** Anti-hero
http://tvtropes.org/pmwiki/pmwiki.php/Main/AntiHero
*** Villains
**** The Empire
http://tvtropes.org/pmwiki/pmwiki.php/Main/TheEmpire
**** The Chessmaster
http://tvtropes.org/pmwiki/pmwiki.php/Main/TheChessmaster
*** Archetypes
**** Mad Scientist
http://tvtropes.org/pmwiki/pmwiki.php/Main/MadScientist
**** Gentle Giant
http://tvtropes.org/pmwiki/pmwiki.php/Main/GentleGiant
*** Modifiers
**** Protagonist
http://tvtropes.org/pmwiki/pmwiki.php/Main/TheProtagonist
**** Antagonist
http://tvtropes.org/pmwiki/pmwiki.php/Main/TheAntagonist
**** Jerk With a Heart of Gold
http://tvtropes.org/pmwiki/pmwiki.php/Main/JerkWithAHeartOfGold
** Modifiers and plot devices
(Arguably, modifiers can't be described temporally. Or can they?!)
*** Darker and edgier
http://tvtropes.org/pmwiki/pmwiki.php/Main/DarkerAndEdgier
*** Plot Device
http://tvtropes.org/pmwiki/pmwiki.php/Main/PlotDevice
An object or character in the story whose purpose is purely to drive the plot.
** Metatropes
**** Lampshade hanging
http://tvtropes.org/pmwiki/pmwiki.php/Main/LampshadeHanging
**** Subverted trope
http://tvtropes.org/pmwiki/pmwiki.php/Main/SubvertedTrope
