tropes.html

          <div id="outline-container-orgheadline11" class="outline-4">
            <h4 id="orgheadline11">Quest</h4>
            <div class="outline-text-4" id="text-orgheadline11">
              <p>
                <a href="http://tvtropes.org/pmwiki/pmwiki.php/Main/TheQuest">http://tvtropes.org/pmwiki/pmwiki.php/Main/TheQuest</a>
              </p>

              <p>
                A quest must have a hero (and supporters), travelling in search of something. Could be a <a href="#orgheadline9">MacGuffin</a>, to defeat the antagonist, or to rescue someone. Or all of these.
              </p>

              <p>
                See <a href="#orgheadline9">MacGuffin</a> above.
              </p>

              <p>
                \(
                \mathit{defeatQuest} \land [B] \mathit{find (Antogonist)} \land [E] (\mathit{defeat (Antagonist)} \lor \mathit{defeat(Protagonist)}))
                \)
              </p>

              <p>
                \(
                \mathit{rescueQuest} \land [B] \mathit{find (Rescuee)} \land [E] \mathit{rescue (Rescuee)}
                \)
              </p>

              <p>
                \(
                \mathit{quest} \land [D] (\mathit{macguffinQuest} \lor \mathit{defeatQuest} \lor \mathit{rescueQuest})
                \)
              </p>
            </div>
          </div>

          <div id="outline-container-orgheadline12" class="outline-4">
            <h4 id="orgheadline12">The Reveal</h4>
            <div class="outline-text-4" id="text-orgheadline12">
              <p>
                <a href="http://tvtropes.org/pmwiki/pmwiki.php/Main/TheReveal">http://tvtropes.org/pmwiki/pmwiki.php/Main/TheReveal</a>
              </p>

              <p>
                The resolution of a twist. The audience is given new information which has been withheld to create suspense.
              </p>

              <p>
                This is a key trope in murder mysteries. In that case, you know that there's a mystery to be solved, and it's solved by the end. Other times, the reveal is a shock (like the endings of <i>The Empire Strikes Back</i> and <i>Fight Club</i>).
              </p>

              <p>
                \(
                \mathit{secret(father(Darth, Luke))} \land [E] \mathit{reveal (father(Darth, Luke))}
                \)
              </p>
            </div>
          </div>
        </div>

        <div id="outline-container-orgheadline15" class="outline-3">
          <h3 id="orgheadline15">Setting/location</h3>
          <div class="outline-text-3" id="text-orgheadline15">
          </div><div id="outline-container-orgheadline5" class="outline-4">
            <h4 id="orgheadline5">Inciting Incident</h4>
            <div class="outline-text-4" id="text-orgheadline5">
              <p>
                <a href="http://tvtropes.org/pmwiki/pmwiki.php/Main/IncitingIncident">http://tvtropes.org/pmwiki/pmwiki.php/Main/IncitingIncident</a>
              </p>

              <p>
                The first thing that sets in motion the sequence of events that form the plot. Ideally, it should foreshadow what the <a href="#orgheadline6">Climax</a> will be like.
              </p>

              <p>
                If it's part of a quest story, the inciting incident would be the <a href="#orgheadline4">Call to Adventure</a>.
              </p>
            </div>
          </div>

          <div id="outline-container-orgheadline4" class="outline-4">
            <h4 id="orgheadline4">Call to Adventure</h4>
            <div class="outline-text-4" id="text-orgheadline4">
              <p>
                <a href="http://tvtropes.org/pmwiki/pmwiki.php/Main/CallToAdventure">http://tvtropes.org/pmwiki/pmwiki.php/Main/CallToAdventure</a>
              </p>


              <p>
                First step on Campbell's <a href="#orgheadline14">Hero's Journey</a>. The hero discovers that he must leave the known world behind and go forth to unknown places.
              </p>

              <p>
                If a hero initially rejects the call, they usually end up worse off for it.
              </p>
            </div>
          </div>

          <div id="outline-container-orgheadline14" class="outline-4">
            <h4 id="orgheadline14">Hero's Journey</h4>
            <div class="outline-text-4" id="text-orgheadline14">
              <p>
                <a href="http://tvtropes.org/pmwiki/pmwiki.php/Main/TheHerosJourney">http://tvtropes.org/pmwiki/pmwiki.php/Main/TheHerosJourney</a>
              </p>

              <p>
                Can be boiled down to three stages:
              </p>

              <ol class="org-ol">
                <li>Departure (hero leaves familiar world behind)</li>
                <li>Initiation (hero learns to navigate the unfamiliar world of adventure)</li>
                <li>Return: the Hero returns to the familiar world</li>
              </ol>

              <p>
                There's more to it than that (see below), but we shouldn't be concerned with that for now.
              </p>

              <p>
                This is analogous to the three parts of the <a href="#orgheadline8">Three Act Structure</a>, so can be seen as a variation on that.
              </p>

              <p>
                Call to adventure &#x2013;(supernatural aid)&#x2013;&gt; Threshold Guardian &#x2013;&gt;
                Threshold (between the known and unknown) &#x2013;(challenges: helper, mentor, temptation)&#x2013;&gt;
                REVELATION: Abyss death &amp; rebirth&#x2013;&gt;Transformation&#x2013;&gt;Atonement&#x2013;&gt;
                Return&#x2013;&gt;Call to adventure again
              </p>
            </div>
          </div>
        </div>
        <div id="outline-container-orgheadline29" class="outline-3">
          <h3 id="orgheadline29">Characters</h3>
          <div class="outline-text-3" id="text-orgheadline29">
          </div><div id="outline-container-orgheadline18" class="outline-4">
            <h4 id="orgheadline18">Heroes</h4>
            <div class="outline-text-4" id="text-orgheadline18">
            </div><ul class="org-ul"><li><a id="orgheadline16"></a>The Chosen One<br  /><div class="outline-text-5" id="text-orgheadline16">
                  <p>
                    <a href="http://tvtropes.org/pmwiki/pmwiki.php/Main/TheChosenOne">http://tvtropes.org/pmwiki/pmwiki.php/Main/TheChosenOne</a>
                  </p>
              </div></li>
              <li><a id="orgheadline17"></a>Anti-hero<br  /><div class="outline-text-5" id="text-orgheadline17">
                  <p>
                    <a href="http://tvtropes.org/pmwiki/pmwiki.php/Main/AntiHero">http://tvtropes.org/pmwiki/pmwiki.php/Main/AntiHero</a>
                  </p>
            </div></li></ul>
          </div>
          <div id="outline-container-orgheadline21" class="outline-4">
            <h4 id="orgheadline21">Villains</h4>
            <div class="outline-text-4" id="text-orgheadline21">
            </div><ul class="org-ul"><li><a id="orgheadline19"></a>The Empire<br  /><div class="outline-text-5" id="text-orgheadline19">
                  <p>
                    <a href="http://tvtropes.org/pmwiki/pmwiki.php/Main/TheEmpire">http://tvtropes.org/pmwiki/pmwiki.php/Main/TheEmpire</a>
                  </p>
              </div></li>
              <li><a id="orgheadline20"></a>The Chessmaster<br  /><div class="outline-text-5" id="text-orgheadline20">
                  <p>
                    <a href="http://tvtropes.org/pmwiki/pmwiki.php/Main/TheChessmaster">http://tvtropes.org/pmwiki/pmwiki.php/Main/TheChessmaster</a>
                  </p>
            </div></li></ul>
          </div>
          <div id="outline-container-orgheadline24" class="outline-4">
            <h4 id="orgheadline24">Archetypes</h4>
            <div class="outline-text-4" id="text-orgheadline24">
            </div><ul class="org-ul"><li><a id="orgheadline22"></a>Mad Scientist<br  /><div class="outline-text-5" id="text-orgheadline22">
                  <p>
                    <a href="http://tvtropes.org/pmwiki/pmwiki.php/Main/MadScientist">http://tvtropes.org/pmwiki/pmwiki.php/Main/MadScientist</a>
                  </p>
              </div></li>
              <li><a id="orgheadline23"></a>Gentle Giant<br  /><div class="outline-text-5" id="text-orgheadline23">
                  <p>
                    <a href="http://tvtropes.org/pmwiki/pmwiki.php/Main/GentleGiant">http://tvtropes.org/pmwiki/pmwiki.php/Main/GentleGiant</a>
                  </p>
            </div></li></ul>
          </div>
          <div id="outline-container-orgheadline28" class="outline-4">
            <h4 id="orgheadline28">Modifiers</h4>
            <div class="outline-text-4" id="text-orgheadline28">
            </div><ul class="org-ul"><li><a id="orgheadline25"></a>Protagonist<br  /><div class="outline-text-5" id="text-orgheadline25">
                  <p>
                    <a href="http://tvtropes.org/pmwiki/pmwiki.php/Main/TheProtagonist">http://tvtropes.org/pmwiki/pmwiki.php/Main/TheProtagonist</a>
                  </p>
              </div></li>
              <li><a id="orgheadline26"></a>Antagonist<br  /><div class="outline-text-5" id="text-orgheadline26">
                  <p>
                    <a href="http://tvtropes.org/pmwiki/pmwiki.php/Main/TheAntagonist">http://tvtropes.org/pmwiki/pmwiki.php/Main/TheAntagonist</a>
                  </p>
              </div></li>
              <li><a id="orgheadline27"></a>Jerk With a Heart of Gold<br  /><div class="outline-text-5" id="text-orgheadline27">
                  <p>
                    <a href="http://tvtropes.org/pmwiki/pmwiki.php/Main/JerkWithAHeartOfGold">http://tvtropes.org/pmwiki/pmwiki.php/Main/JerkWithAHeartOfGold</a>
                  </p>
            </div></li></ul>
          </div>
        </div>
        <div id="outline-container-orgheadline30" class="outline-3">
          <h3 id="orgheadline30">Modifiers and plot devices</h3>
          <div class="outline-text-3" id="text-orgheadline30">
            <p>
              (Arguably, modifiers can't be described temporally. Or can they?!)
            </p>
          </div>
          <div id="outline-container-orgheadline31" class="outline-4">
            <h4 id="orgheadline31">Darker and edgier</h4>
            <div class="outline-text-4" id="text-orgheadline31">
              <p>
                <a href="http://tvtropes.org/pmwiki/pmwiki.php/Main/DarkerAndEdgier">http://tvtropes.org/pmwiki/pmwiki.php/Main/DarkerAndEdgier</a>
              </p>
            </div>
          </div>
          <div id="outline-container-orgheadline10" class="outline-4">
            <h4 id="orgheadline10">Plot Device</h4>
            <div class="outline-text-4" id="text-orgheadline10">
              <p>
                <a href="http://tvtropes.org/pmwiki/pmwiki.php/Main/PlotDevice">http://tvtropes.org/pmwiki/pmwiki.php/Main/PlotDevice</a>
                An object or character in the story whose purpose is purely to drive the plot.
              </p>
            </div>
          </div>
        </div>
        <div id="outline-container-orgheadline34" class="outline-3">
          <h3 id="orgheadline34">Metatropes</h3>
          <div class="outline-text-3" id="text-orgheadline34">
          </div><ul class="org-ul"><li><a id="orgheadline32"></a>Lampshade hanging<br  /><div class="outline-text-5" id="text-orgheadline32">
                <p>
                  <a href="http://tvtropes.org/pmwiki/pmwiki.php/Main/LampshadeHanging">http://tvtropes.org/pmwiki/pmwiki.php/Main/LampshadeHanging</a>
                </p>
            </div></li>
            <li><a id="orgheadline33"></a>Subverted trope<br  /><div class="outline-text-5" id="text-orgheadline33">
                <p>
                  <a href="http://tvtropes.org/pmwiki/pmwiki.php/Main/SubvertedTrope">http://tvtropes.org/pmwiki/pmwiki.php/Main/SubvertedTrope</a>
                </p>
          </div></li></ul>
        </div>
