tropes.org
** Propp's story functions as tropes
http://tvtropes.org/pmwiki/pmwiki.php/Main/ProppsFunctionsOfFolktales
** Examples
*** Star Wars
*** Breaking Bad
*** Lord of the Rings: The Fellowship of the Ring
*** Raymond Chandler
http://tvtropes.org/pmwiki/pmwiki.php/Main/ChandlersLaw

/When in doubt, have a man come through a door with a gun in his hand./

-----

#+HTML:<div align=center>
[[http://mthompson.org][Home]]
#+HTML:</div>
