tropes.html
        <div id="outline-container-orgheadline35" class="outline-3">
          <h3 id="orgheadline35">Propp's story functions as tropes</h3>
          <div class="outline-text-3" id="text-orgheadline35">
            <p>
              <a href="http://tvtropes.org/pmwiki/pmwiki.php/Main/ProppsFunctionsOfFolktales">http://tvtropes.org/pmwiki/pmwiki.php/Main/ProppsFunctionsOfFolktales</a>
            </p>
          </div>
        </div>
        <div id="outline-container-orgheadline40" class="outline-3">
          <h3 id="orgheadline40">Examples</h3>
          <div class="outline-text-3" id="text-orgheadline40">
          </div><div id="outline-container-orgheadline36" class="outline-4">
            <h4 id="orgheadline36">Star Wars</h4>
          </div>
          <div id="outline-container-orgheadline37" class="outline-4">
            <h4 id="orgheadline37">Breaking Bad</h4>
          </div>
          <div id="outline-container-orgheadline38" class="outline-4">
            <h4 id="orgheadline38">Lord of the Rings: The Fellowship of the Ring</h4>
          </div>
          <div id="outline-container-orgheadline39" class="outline-4">
            <h4 id="orgheadline39">Raymond Chandler</h4>
            <div class="outline-text-4" id="text-orgheadline39">
              <p>
                <a href="http://tvtropes.org/pmwiki/pmwiki.php/Main/ChandlersLaw">http://tvtropes.org/pmwiki/pmwiki.php/Main/ChandlersLaw</a>
              </p>

              <p>
                <i>When in doubt, have a man come through a door with a gun in his hand.</i>
              </p>

              <hr  />

              <div align=center>
                <p>
                  <a href="http://mthompson.org/">Home</a>
                </p>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
  </body>
</html>
